// 1) У нас есть массив с элементами 1, 2, 5, 6, 88, 5.
//    С помощью цикла надо найти сумму элементов этого массива.


// const num = [1, 2, 5, 6, 88, 5]

// sum = 0
// for ([0] in num) {
//     sum += element

//     alert(sum)
// }


// let num = [1, 2, 5, 6, 88, 5];
// let sum = 0;

// for (let i = 0; i < num.length; i++) {
//     sum += num[i];
// }

// alert(sum);


// 2) Создайте массив с различными числами. Должно быть как минимум 10 элементов 
//    внутри массива. С помощью цикла найдите сумму квадратов элементов этого массива. 
//    Квадрат числа 5 будет 25.

// let num = [2, 4, 6, 5, 3, 8, 9, 7, 3, 11]
// let sum = 0

// for (let i = 0; i < num.length; i++) {
//     sum += num[i] * num[i];
// }

// alert(sum)

let num = [2, 4, 6, 5, 3, 8, 9, 7, 3, 11];
let squares = 0;

for (let i = 0; i < num.length; i++) {
    squares += num[i] * num[i];

    console.log(`Текущий элемент: ${num[i]}, Сумма: ${squares}`);
}

// let num = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20];

// for (let i = 0; i < num.length; i++) {
//     if (num[i] % 2 === 0) {
//         alert(num[i]);
//     }
// }